{ ******  АЛГОРИТМ ЗАПИСИ ДАННЫХ С КЛАВИАТУРЫ НА ДИСК  **************** }
{   Ввести с клавиатуры фамилию и заработную плату для каждого из       }
{       n сотрудников  предприятия и записать эти данные на диск.       }
{        Затем считать эти данные с диска и вывести на экран            }

{      ***** Задания на «3». *****
1.	Добавить массив Prof с названием профессии или занимаемой должности работника.
2.	Записать массив должностей в отдельный файл Prof.dat.
3.	Прочитать данные из файла Prof.dat в массив Prof.
4.	Вывести на экран данные из массива Prof.

       ***** Задания на «4». *****
1.	Открыть программу предыдущего урока (записи про учащихся с оценками).
2.	Создать дисковый файл и поместить в него массив из записей об учащихся.
       ***** Задания на «5». *****
3.	Открыть файл для чтения и прочитать данные в массив записей.
4.	Вывести на экран записи из массива записей. } 

Program Input_disc;
  Uses Crt;
  Const  n=3;{число сотрудников}
  Type {раздел описания типов заданных пользователем }
       TypeFamily=Array[1..n] of string;
       TypeMoney=Array[1..n] of  Integer;
       TypeProf=Array[1..n] of string;
  Var  Family : TypeFamily;
       Money:  TypeMoney;
       Prof: TypeProf;
       f1: text;    { текстовый файл }
       f2: file;    { типизированный двоичный файл }
       f3: file;
       i:integer;
{*********************************************}
  Begin
    ClrScr;
    WriteLn('===[ Ввод заработной платы. ]==='); 
    For i:=1 to n do
        begin
          WriteLn('  Введите данные для ',i,' сотрудника : ');
          Write('Фамилия: '); ReadLn(Family[i]);
          Write('Зарплата: '); ReadLn(Money[i]);
          Write('Профессия: '); ReadLn(Prof [i]);
        end;
 {************** Запись массивов в файлы на диске  ********************}
 { связать файловую переменную f1 с идентификатором (именем) Family.txt}
  Assign(f1,'Family.txt');
 { открыть файл f1 для записи на текущем диске }
  ReWrite(f1);
 { записать в него массив Family по одной фамилии в строке }
    for i:=1 to n do Writeln(f1,Family[i]);
  Close(f1); { закрыть файл на диске }

  Assign(f2,'Money.dat');
  ReWrite(f2);
  Write(f2,Money);
  Close(f2);
  
  Assign (f3, 'Prof.dat');
  ReWrite (f3);
  Write (f3,Prof);
  Close (f3);
 {************************* Чтение с диска  ****************************}
  Assign(f1,'Family.dat');
 { открыть фаил f1 для чтения на текущем диске }
  ReSet(f1);
 { считать из него данные в массив Family }
  for i:=1 to n do Readln(f1,Family[i]);
  Close(f1);

  Assign(f2,'Money.dat');
  ReSet(f2);
  Read(f2,Money);
  Close(f2);
  
  Assign (f3, 'Prof.dat');
  ReSet (f3);
  Read (f3,Prof);
  Close (f3); 
 {************************* Вывод на экран ****************************}
  WriteLn('===[ Вывод заработной платы. ]===');
  For i:=1 to n do
    begin
       Write('   Фамилия: ',Family[i]:10);
       WriteLn('   Зарплата: ',Money[i]:10);
       WriteLn (' Профессия: ', Prof [i]:10);
    end;

End.
